#pragma once

// ANAREA (4.24) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Anarea.ItemDataAsset
// 0x0090 (0x00C0 - 0x0030)
class UItemDataAsset : public UDataAsset
{
public:
	struct FItemBaseData                               baseData;                                                 // 0x0030(0x0090) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.ItemDataAsset");
		return ptr;
	}


	struct FItemBaseData MakeItemBaseData(class UObject** WorldContextObject, struct FItemKey* ItemKey);
};


// Class Anarea.AmmoItemDataAsset
// 0x0000 (0x00C0 - 0x00C0)
class UAmmoItemDataAsset : public UItemDataAsset
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AmmoItemDataAsset");
		return ptr;
	}

};


// Class Anarea.AnareaGameInstance
// 0x0168 (0x02D0 - 0x0168)
class UAnareaGameInstance : public UGameInstance
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0168(0x0008) MISSED OFFSET
	class UDataTable*                                  HitFXDataTable;                                           // 0x0170(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UItemDatabase*                               ItemDatabase;                                             // 0x0178(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDataTable*                                  LootDataTable;                                            // 0x0180(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDataTable*                                  ShootingWeaponDataTable;                                  // 0x0188(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDataTable*                                  GrenadeWeaponDataTable;                                   // 0x0190(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	ECrosshairToUse                                    CrosshairToUse;                                           // 0x0198(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      WantHideHUD;                                              // 0x0199(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FOV;                                                      // 0x019C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      EnableCSM;                                                // 0x01A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ToggleSprint;                                             // 0x01A1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TMap<struct FGameplayTag, class UClass*>           TaggedGameplayEffects;                                    // 0x01A8(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData01[0x50];                                      // 0x01F8(0x0050) UNKNOWN PROPERTY: SetProperty Anarea.AnareaGameInstance.ListOfLoadedSubLevels
	struct FVector                                     DefaultControllerLocation;                                // 0x0248(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FPlayerMatchData                            LastPlayerMatchData;                                      // 0x0254(0x000C) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      HasAnyLastPlayerMatchData;                                // 0x0260(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisconnectReason;                                         // 0x0268(0x0018) (BlueprintVisible, BlueprintReadOnly)
	struct FScriptMulticastDelegate                    OnCrosshairChangedDelegate;                               // 0x0280(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0xF];                                       // 0x0280(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnWantHideHUDSettingChangedDelegate;                      // 0x0290(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0xF];                                       // 0x0290(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnFOVSettingChangedDelegate;                              // 0x02A0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0xF];                                       // 0x02A0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnEnableCSMSettingChangedDelegate;                        // 0x02B0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData05[0xF];                                       // 0x02B0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnToggleSprintSettingChangedDelegate;                     // 0x02C0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData06[0xF];                                       // 0x02C0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnareaGameInstance");
		return ptr;
	}


	float SetFOV(float* InFov);
	void ResetDisconnectReason();
	void ReceiveLevelStreamingUnloaded();
	void ReceiveLevelStreamingLoaded();
	void OnWantHideHUDSettingChanged_DelegateSignature__DelegateSignature();
	void OnToggleSprintSettingChanged_DelegateSignature__DelegateSignature();
	void OnFOVSettingChanged_DelegateSignature__DelegateSignature();
	void OnEnableCSMSettingChanged_DelegateSignature__DelegateSignature();
	void OnCrosshairChanged_DelegateSignature__DelegateSignature();
	bool GetHasDisconnectReason();
};


// Class Anarea.AnareaGameModeBase
// 0x01F0 (0x04A8 - 0x02B8)
class AAnareaGameModeBase : public APlayFabGameModeBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02B8(0x0008) MISSED OFFSET
	int                                                SpawnZoneGridRowCount;                                    // 0x02C0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                SpawnZoneGridColCount;                                    // 0x02C4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PercentageOfForbiddenZones;                               // 0x02C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                MaxZoneSize;                                              // 0x02CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                MaxPlayerSpawnPerZone;                                    // 0x02D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x50];                                      // 0x02D4(0x0050) UNKNOWN PROPERTY: SetProperty Anarea.AnareaGameModeBase.PlayersWaitingLobbyLoading
	TMap<class APlayerController*, struct FTimerHandle> PlayerWaitingLobbyLoadingTimeoutFallbacks;                // 0x0328(0x0050) (ZeroConstructor)
	int                                                MinPlayersToWaitBeforeLaunchingMatch;                     // 0x0378(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UseMaxWaitTimeBeforeLaunchingMatch;                       // 0x037C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxWaitTimeBeforeLaunchingMatch;                          // 0x0380(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LaunchZoneSelectionPhaseDuration;                         // 0x0384(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ZoneSelectionPhaseDuration;                               // 0x0388(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LoadMatchPhaseDuration;                                   // 0x038C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LaunchMatchPhaseDuration;                                 // 0x0390(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EndMatchPhaseDuration;                                    // 0x0394(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EGamePhase                                         currentGamePhase;                                         // 0x0398(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FTimerHandle                                MaxWaitTimeBeforeLaunchingMatchTimer;                     // 0x03A0(0x0008)
	TArray<class ALobbyPlayerStart*>                   AllLobbyPlayerStarts;                                     // 0x03A8(0x0010) (ZeroConstructor)
	TArray<struct FZonePlayerStarts>                   MatchPlayerStartsPerZone;                                 // 0x03B8(0x0010) (ZeroConstructor)
	TArray<class APlayerStart*>                        AvaillablePlayerStartsForMatch;                           // 0x03C8(0x0010) (ZeroConstructor)
	struct FTimerHandle                                CheckRemainingPlayerCountBeforeRestartingGameTimer;       // 0x03D8(0x0008)
	int                                                TotalPlayerCountAtBegining;                               // 0x03E0(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FScoreRules                                 ScoreRules;                                               // 0x03E8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      BlockBackfilling;                                         // 0x0400(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xA7];                                      // 0x0401(0x00A7) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnareaGameModeBase");
		return ptr;
	}


	void OnPlayerFullyJoinLobbyTimeoutFallback(class ABasePlayerController** Player);
	void OnPlayerFullyJoinLobby(class ABasePlayerController** Player);
	float GetPhaseDuration(EGamePhase* gamePhase);
};


// Class Anarea.AnareaGameStateBase
// 0x0090 (0x02E8 - 0x0258)
class AAnareaGameStateBase : public AGameStateBase
{
public:
	struct FGamePhaseReplicatedInfo                    ReplicatedGamePhaseInfo;                                  // 0x0258(0x000C) (BlueprintVisible, BlueprintReadOnly, Net)
	int                                                RemainingPlayersInMatch;                                  // 0x0264(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	int                                                MaxKillfeedEntriesToStore;                                // 0x0268(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FKillfeedEntry>                      KillFeedInfos;                                            // 0x0270(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                KillFeedInfosCircularFirstIndex;                          // 0x0280(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                winnerID;                                                 // 0x0284(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	struct FString                                     MatchId;                                                  // 0x0288(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor)
	class UPlayerSpawnSystemComponent*                 PlayerSpawnSystem;                                        // 0x0298(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UStormZoneHandler*                           StormZoneHandler;                                         // 0x02A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x02A8(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnRemainingPlayersInMatchChangedDelegate;                 // 0x02B8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xF];                                       // 0x02A8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnKillfeedUpdatedDelegate;                                // 0x02C8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0xF];                                       // 0x02C8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnWinnerSelectedDelegate;                                 // 0x02D8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0xF];                                       // 0x02D8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnareaGameStateBase");
		return ptr;
	}


	void OnRep_WinnerID();
	void OnRep_ReplicatedGamePhaseInfo(struct FGamePhaseReplicatedInfo* prevGamePhase);
	void OnRep_RemainingPlayersInMatch();
	void OnRep_MatchID();
	void AddKillfeedEntry(struct FKillfeedEntryInfo* killfeedInfo);
};


// Class Anarea.AnareaGameUserSettings
// 0x0030 (0x0150 - 0x0120)
class UAnareaGameUserSettings : public UGameUserSettings
{
public:
	float                                              AudioVolume_Master;                                       // 0x0120(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              AudioVolume_Effects;                                      // 0x0124(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              AudioVolume_Voices;                                       // 0x0128(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              AudioVolume_Music;                                        // 0x012C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	ECrosshairToUse                                    CrosshairShape;                                           // 0x0130(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      WantHideHUD;                                              // 0x0131(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              FOV;                                                      // 0x0134(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      EnableCSM;                                                // 0x0138(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      ToggleSprint;                                             // 0x0139(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnUserSettingsAppliedDelegate;                            // 0x0140(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x013A(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnareaGameUserSettings");
		return ptr;
	}


	void SetWantHideHUD(bool* inWantHideHUD);
	void SetVoicesVolume(float* Value);
	void SetToggleSprint(bool* inToggleSprint);
	void SetMusicVolume(float* Value);
	void SetMasterVolume(float* Value);
	void SetFOV(float* InFov);
	void SetEnableCSM(bool* inEnableCSM);
	void SetEffectsVolume(float* Value);
	void SetCrosshairShape(ECrosshairToUse* inCrosshairToUse);
	class UAnareaGameUserSettings* STATIC_GetAnareaGameUserSettings();
};


// Class Anarea.AnimBPInterface
// 0x0000 (0x0028 - 0x0028)
class UAnimBPInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnimBPInterface");
		return ptr;
	}


	void SetIsAiming(bool* isAiming);
	void ChangeWeaponSetDetail(EWeaponSetDetail* weaponSetDetail);
	void ChangeUpperbodyAnimMode(EWeaponSet* animMode);
};


// Class Anarea.AnimationHandler
// 0x0138 (0x01E8 - 0x00B0)
class UAnimationHandler : public UActorComponent
{
public:
	unsigned char                                      UseDataTableToInitializeAnimations;                       // 0x00B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDataTable*                                  AnimationsDataTable;                                      // 0x00B8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       RowNameInAnimationsDataTable;                             // 0x00C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TMap<struct FGameplayTag, class UAnimMontage*>     NamedAnimations;                                          // 0x00C8(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	EWeaponSet                                         UpperbodyAnimMode;                                        // 0x0118(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	EWeaponSetDetail                                   weaponSetDetail;                                          // 0x0119(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      isAiming;                                                 // 0x011A(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	TMap<struct FName, struct FEquipAnimInfos>         SocketToEquipAnims;                                       // 0x0120(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TMap<class UAnimMontage*, class UAnimMontage*>     MontageMappingForFPSMesh;                                 // 0x0170(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData00[0x10];                                      // 0x01C0(0x0010) MISSED OFFSET
	unsigned char                                      ForceBypassGrabAnimations;                                // 0x01D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ForceBypassHolsterAnimations;                             // 0x01D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    AnimNotifyDelegate;                                       // 0x01D8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xF];                                       // 0x01D2(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnimationHandler");
		return ptr;
	}


	void Server_SetIsAiming(bool* NewValue);
	void Server_ChangeUpperbodyAnimMode(EWeaponSet* newWeaponSet, EWeaponSetDetail* newWeaponSetDetail);
	void OnRep_WeaponSetDetail();
	void OnRep_UpperbodyAnimMode();
	void OnRep_IsAiming();
	class UAnimMontage* GetNamedAnimation(struct FGameplayTag* animName, bool* forTPSMesh);
	class UAnimInstance* GetLinkedAnimBP();
};


// Class Anarea.AnimationHandlerInterface
// 0x0000 (0x0028 - 0x0028)
class UAnimationHandlerInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnimationHandlerInterface");
		return ptr;
	}

};


// Class Anarea.AnimNotifyReceiverInterface
// 0x0000 (0x0028 - 0x0028)
class UAnimNotifyReceiverInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AnimNotifyReceiverInterface");
		return ptr;
	}


	void ReceiveAnimNotify(struct FGameplayTag* GameplayTag);
};


// Class Anarea.AssetLoadingSubsystem
// 0x00E8 (0x0118 - 0x0030)
class UAssetLoadingSubsystem : public UGameInstanceSubsystem
{
public:
	unsigned char                                      UnknownData00[0xE8];                                      // 0x0030(0x00E8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.AssetLoadingSubsystem");
		return ptr;
	}

};


// Class Anarea.BaseAbilitySystemComponent
// 0x0140 (0x1428 - 0x12E8)
class UBaseAbilitySystemComponent : public UAbilitySystemComponent
{
public:
	class UEquipmentHandler*                           LinkedEquipmentHandler;                                   // 0x12E8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAnimationHandler*                           LinkedAnimationHandler;                                   // 0x12F0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USightHandler*                               LinkedSightHandler;                                       // 0x12F8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UInventoryComponent*                         LinkedInventory;                                          // 0x1300(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UInventoryComponent*                         LinkedEquipmentInventory;                                 // 0x1308(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      IsUsedByAI;                                               // 0x1310(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      IsAlive;                                                  // 0x1311(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_Health;                          // 0x1318(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x1312(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_MaxHealth;                       // 0x1328(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xF];                                       // 0x1328(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_Stamina;                         // 0x1338(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0xF];                                       // 0x1338(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_MaxStamina;                      // 0x1348(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0xF];                                       // 0x1348(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_Shield;                          // 0x1358(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0xF];                                       // 0x1358(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_MaxShield;                       // 0x1368(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData05[0xF];                                       // 0x1368(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_MoveSpeed;                       // 0x1378(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData06[0xF];                                       // 0x1378(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_AttackSpeed;                     // 0x1388(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData07[0xF];                                       // 0x1388(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    AttributeChangedDelegate_Armor;                           // 0x1398(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData08[0xF];                                       // 0x1398(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OutOfStaminaDelegate_ServerOnly;                          // 0x13A8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData09[0xF];                                       // 0x13A8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OutOfShieldDelegate_ServerOnly;                           // 0x13B8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData10[0xF];                                       // 0x13B8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnDeathDelegate;                                          // 0x13C8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData11[0xF];                                       // 0x13C8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnAbilityCommited_BP;                                     // 0x13D8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData12[0xF];                                       // 0x13D8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnConsumableEffectBeginApply;                             // 0x13E8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData13[0xF];                                       // 0x13E8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnConsumableEffectEndApply;                               // 0x13F8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData14[0xF];                                       // 0x13F8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnConsumableEffectCanceled;                               // 0x1408(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData15[0xF];                                       // 0x1408(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnConsumableEffectBeginWaitApplicationDelegate;           // 0x1418(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData16[0xF];                                       // 0x1418(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseAbilitySystemComponent");
		return ptr;
	}


	void ReceiveHealthChanged();
	void OnRep_IsAlive();
	void BP_FakeAbilityLocalInputReleased(struct FString* InputName);
	void BP_FakeAbilityLocalInputPressed(struct FString* InputName);
	void BP_CancelAbilityWithClass(class UClass** abilityClass);
};


// Class Anarea.BasePlayerAnimBP
// 0x0010 (0x0280 - 0x0270)
class UBasePlayerAnimBP : public UAnimInstance
{
public:
	unsigned char                                      UseLeftHandGripIK;                                        // 0x0270(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ForceNoLeftHandIK;                                        // 0x0271(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UseCurveForLeftHandGripIK;                                // 0x0272(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ShouldAttachWeaponToLeftHand;                             // 0x0273(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0274(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BasePlayerAnimBP");
		return ptr;
	}


	bool PlayPawnDeathAnim(struct FDamageCauseInfo* deathCauseInfo);
};


// Class Anarea.BaseAttributeSet
// 0x00D0 (0x0100 - 0x0030)
class UBaseAttributeSet : public UAttributeSet
{
public:
	float                                              LastDamageReceivedTime;                                   // 0x0030(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FTimerHandle                                LastDamageReceiveTimerHandle;                             // 0x0038(0x0008) (BlueprintVisible, BlueprintReadOnly)
	struct FGameplayAttributeData                      Health;                                                   // 0x0040(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      MaxHealth;                                                // 0x0050(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      Stamina;                                                  // 0x0060(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      MaxStamina;                                               // 0x0070(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      Shield;                                                   // 0x0080(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      MaxShield;                                                // 0x0090(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      MoveSpeed;                                                // 0x00A0(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      AttackSpeed;                                              // 0x00B0(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      Armor;                                                    // 0x00C0(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FGameplayAttributeData                      PhysicalDamage;                                           // 0x00D0(0x0010) (BlueprintVisible, BlueprintReadOnly)
	struct FGameplayAttributeData                      DirectHealthDamage;                                       // 0x00E0(0x0010) (BlueprintVisible, BlueprintReadOnly)
	struct FGameplayAttributeData                      Buffer;                                                   // 0x00F0(0x0010) (BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseAttributeSet");
		return ptr;
	}


	void OnRep_Stamina();
	void OnRep_Shield();
	void OnRep_MoveSpeed();
	void OnRep_MaxStamina();
	void OnRep_MaxShield();
	void OnRep_MaxHealth();
	void OnRep_Health();
	void OnRep_AttackSpeed();
	void OnRep_Armor();
	void CheckResistantSkillApplication();
};


// Class Anarea.BaseCompassItemWidget
// 0x0010 (0x0240 - 0x0230)
class UBaseCompassItemWidget : public UUserWidget
{
public:
	TScriptInterface<class UCompassAgent>              LinkedCompassAgent;                                       // 0x0230(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseCompassItemWidget");
		return ptr;
	}

};


// Class Anarea.BaseInventoryPanel
// 0x0080 (0x02B0 - 0x0230)
class UBaseInventoryPanel : public UUserWidget
{
public:
	TArray<class UInventoryComponent*>                 Models_Inventories;                                       // 0x0230(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	class UItemUserComponent*                          Model_ItemUser;                                           // 0x0240(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UNearbyItemDetector*                         Model_NearbyItemDetector;                                 // 0x0248(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UClass*                                      SlotClassToUse;                                           // 0x0250(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ContextMenuClassToUse;                                    // 0x0258(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      CanCreateNewSlots;                                        // 0x0260(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      AlwaysSortInventory;                                      // 0x0261(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UDropLayerBase*>                      DropLayers;                                               // 0x0268(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient)
	TArray<class UInventorySlotWidgetBase*>            SlotArray;                                                // 0x0278(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient)
	class UPanelWidget*                                SlotsContainer;                                           // 0x0288(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnWantDisplayItemTooltipDelegate;                         // 0x0290(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0290(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnWantHideItemTooltipDelegate;                            // 0x02A0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xF];                                       // 0x02A0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseInventoryPanel");
		return ptr;
	}


	void UpdateSlotLinkedToItemInWorld(class AItemInWorld** ItemInWorld);
	void UpdateSlot(int* slotIndex, class UInventoryComponent** SlotOwningInventory);
	class UInventorySlotWidgetBase* TryGetSlot(int* slotIndex, class UInventoryComponent** owningInventory, class AItemInWorld** LinkedItemInWorld);
	void SetModels(TArray<class UInventoryComponent*>* inventoryModels, class UItemUserComponent** itemUserModel, class UNearbyItemDetector** NearbyItemDetector);
	void ReceiveRightClickOnSlot(int* slotIndex, class UInventoryComponent** SlotOwningInventory, class AItemInWorld** LinkedItemInWorld);
	void ReceiveOnSlotUnlocked(int* slotIndex, class UInventoryComponent** owningInventory);
	void ReceiveOnSlotLocked(int* slotIndex, class UInventoryComponent** owningInventory);
	void ReceiveMouseLeaveSlot();
	void ReceiveMouseEnterSlot(int* slotIndex, class UInventoryComponent** SlotOwningInventory, class AItemInWorld** LinkedItemInWorld);
	void ReceiveMouseDoubleClick(int* slotIndex, class UInventoryComponent** SlotOwningInventory, class AItemInWorld** LinkedItemInWorld);
	void ReceiveLootboxRemovedInNearbyDetector(class ALootbox** Lootbox);
	void ReceiveLootboxAddedInNearbyDetector(class ALootbox** Lootbox);
	void ReceiveItemUnlockedInNearbyDetector(class AItemInWorld** ItemInWorld);
	void ReceiveItemRemovedInNearbyDetector(class AItemInWorld** ItemInWorld);
	void ReceiveItemModifiedInNearbyDetector(class AItemInWorld** ItemInWorld);
	void ReceiveItemLockedInNearbyDetector(class AItemInWorld** ItemInWorld);
	void ReceiveItemAddedInNearbyDetector(class AItemInWorld** ItemInWorld);
	void ReceiveDragSlot(int* slotIndex, class UInventoryComponent** owningSlotInventory, class AItemInWorld** LinkedItemInWorld, bool* wantSplit);
	void ReceiveDragLeaveOnDropLayer(class UDropLayerBase** dropLayer);
	void ReceiveDragEnterOnDropLayer(class UDropLayerBase** dropLayer);
	void ReceiveDragEnd();
	void ReceiveDragCanceled();
	void ReceiveDragBegin();
	void ReceiveButtonUpOnDropLayer(class UDropLayerBase** dropLayer);
	void OnWantHideItemTooltip_DelegateSignature__DelegateSignature();
	void OnWantDisplayItemTooltip_DelegateSignature__DelegateSignature(struct FItemInstance* Item);
	void OnModelsChanged();
	void InitVisual();
	void InitUMGRefs(TArray<class UDropLayerBase*>* InDropLayers, TArray<class UInventorySlotWidgetBase*>* InSlotArray, class UPanelWidget** InSlotContainer);
	void ClearSlotLinkedToItemInWorld(class AItemInWorld** ItemInWorld);
	void ClearSlot(int* slotIndex, class UInventoryComponent** owningInventory);
	void ClearAllSlotsLinkedToInventory(class UInventoryComponent** Inventory);
};


// Class Anarea.BaseEquipmentPanel
// 0x0008 (0x02B8 - 0x02B0)
class UBaseEquipmentPanel : public UBaseInventoryPanel
{
public:
	class UEquipmentHandler*                           Model_EquipmentHandler;                                   // 0x02B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseEquipmentPanel");
		return ptr;
	}


	void SetModel_EquipmentHandler(class UEquipmentHandler** EquipmentHandler);
	void ReceiveEquippedWeaponChanged();
};


// Class Anarea.BaseGameplayAbility
// 0x0008 (0x0408 - 0x0400)
class UBaseGameplayAbility : public UGameplayAbility
{
public:
	EAbilityInputs                                     InputKeyEnum;                                             // 0x0400(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseGameplayAbility");
		return ptr;
	}


	bool HasAuthority();
};


// Class Anarea.BaseGameplayEffect
// 0x0000 (0x0770 - 0x0770)
class UBaseGameplayEffect : public UGameplayEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseGameplayEffect");
		return ptr;
	}

};


// Class Anarea.BaseLocomotionGameplayEffect
// 0x0000 (0x0770 - 0x0770)
class UBaseLocomotionGameplayEffect : public UGameplayEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseLocomotionGameplayEffect");
		return ptr;
	}

};


// Class Anarea.BaseMapDelimiter
// 0x0008 (0x0220 - 0x0218)
class ABaseMapDelimiter : public AActor
{
public:
	class UBoxComponent*                               Shape;                                                    // 0x0218(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BaseMapDelimiter");
		return ptr;
	}

};


// Class Anarea.CustomCharacter
// 0x0020 (0x0650 - 0x0630)
class ACustomCharacter : public ACharacter
{
public:
	unsigned char                                      bIsCrawling : 1;                                          // 0x0630(0x0001) (BlueprintVisible, BlueprintReadOnly, Net BITFIELD: 0101)
	unsigned char                                      bIsSprinting : 1;                                         // 0x0630(0x0001) (BlueprintVisible, BlueprintReadOnly, Net BITFIELD: 0202)
	unsigned char                                      bIsJogging : 1;                                           // 0x0630(0x0001) (BlueprintVisible, BlueprintReadOnly, Net BITFIELD: 0404)
	unsigned char                                      UnknownData00[0x1F];                                      // 0x0631(0x001F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.CustomCharacter");
		return ptr;
	}


	void UnCrawl();
	void ReceiveAimModeChanged(bool* isAiming);
	void OnRep_IsSprinting();
	void OnRep_IsJogging();
	void OnRep_IsCrawling();
	void K2_OnStartSprint();
	void K2_OnStartJog();
	void K2_OnStartCrawl(float* HalfHeightAdjust, float* ScaledHalfHeightAdjust);
	void K2_OnEndSprint();
	void K2_OnEndJog();
	void K2_OnEndCrawl(float* HalfHeightAdjust, float* ScaledHalfHeightAdjust);
	void EndSprint();
	void EndJog();
	void Crawl();
	void BeginSprint();
	void BeginJog();
};


// Class Anarea.BasePlayerCharacter
// 0x01D0 (0x0820 - 0x0650)
class ABasePlayerCharacter : public ACustomCharacter
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0650(0x0030) MISSED OFFSET
	class USpringArmComponent*                         CameraBoom;                                               // 0x0680(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UCameraComponent*                            FollowCamera;                                             // 0x0688(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UEquipmentHandler*                           EquipmentHandler;                                         // 0x0690(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UAnimationHandler*                           AnimationHandler;                                         // 0x0698(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USightHandler*                               SightHandler;                                             // 0x06A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UBaseAbilitySystemComponent*                 AbilitySystem;                                            // 0x06A8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UBaseAttributeSet*                           AttributSet;                                              // 0x06B0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class ULocomotionHandler*                          LocomotionHandler;                                        // 0x06B8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UBulletHandler*                              BulletHandler;                                            // 0x06C0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UAudioComponent*                             FootstepAudioComponent;                                   // 0x06C8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UAudioComponent*                             JumpAudioComponent;                                       // 0x06D0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UAudioComponent*                             LandAudioComponent;                                       // 0x06D8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UInventoryComponent*                         Inventory;                                                // 0x06E0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UItemUserComponent*                          ItemUser;                                                 // 0x06E8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UInventoryComponent*                         EquipmentInventory;                                       // 0x06F0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UNearbyItemDetector*                         NearbyItemsDetector;                                      // 0x06F8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UCompassComponent*                           Compass;                                                  // 0x0700(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      BackpackMesh;                                             // 0x0708(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	float                                              CorpseDisparitionTime;                                    // 0x0710(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      LootboxToSpawn;                                           // 0x0718(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0720(0x0008) MISSED OFFSET
	class UClass*                                      KillSelfGE;                                               // 0x0728(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      FallingDamageGE;                                          // 0x0730(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 FallingDamageCurve;                                       // 0x0738(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              DefaultEffectsToApply;                                    // 0x0740(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TMap<class UClass*, EAbilityInputs>                DefaultGameplayAbilities;                                 // 0x0750(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FDamageCauseInfo                            LastDamageCauseInfo;                                      // 0x07A0(0x0038)
	float                                              MinCrouchInputDelay;                                      // 0x07D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              BaseTurnRate;                                             // 0x07DC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              BaseLookUpRate;                                           // 0x07E0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              SprintInputPressed;                                       // 0x07E4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              LastCrouchInputTime;                                      // 0x07E8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	class UClass*                                      LocomotionGEClass_Fall;                                   // 0x07F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FActiveGameplayEffectHandle                 LocomotionGEHandle_Fall;                                  // 0x07F8(0x0008) (BlueprintVisible, BlueprintReadOnly)
	class UClass*                                      LocomotionGEClass_Jog;                                    // 0x0800(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FActiveGameplayEffectHandle                 LocomotionGEHandle_Jog;                                   // 0x0808(0x0008) (BlueprintVisible, BlueprintReadOnly)
	class UClass*                                      LocomotionGEClass_Sprint;                                 // 0x0810(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FActiveGameplayEffectHandle                 LocomotionGEHandle_Sprint;                                // 0x0818(0x0008) (BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BasePlayerCharacter");
		return ptr;
	}


	void TryInteract();
	void ToggleCrouch();
	void Server_ReceivePlayerMenuClosed();
	void Server_InteractWithSkillCrate(class ASkillCrate** SkillCrate);
	void Server_InteractWithLootbox(class ALootbox** Lootbox);
	void Server_InteractWithDoor(class AReplicatedDoor** door, bool* openRight);
	bool PlayPawnDeathAnim(struct FDamageCauseInfo* deathCauseInfo);
	void K2_HandlePawnDeath();
	void InputEndSprint();
	void InputBeginSprint();
	void HandlePawnDeath();
	void EnableRagdoll(bool* applyImpulse, struct FVector* Impulse, bool* impulseAsVelocityChange);
	void Client_HandlePawnDeath(struct FDamageCauseInfo* damageCause);
	void ApplyCosmetics_CharacterModel();
	void ApplyCosmetics_Backpack();
};


// Class Anarea.BasePlayerController
// 0x00C0 (0x0658 - 0x0598)
class ABasePlayerController : public APlayFabPlayerController
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0598(0x0010) MISSED OFFSET
	ELocalPlayerGamePhase                              LocalPlayerGamePhase;                                     // 0x05A8(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	struct FPlayerMatchData                            MatchData;                                                // 0x05B0(0x000C)
	unsigned char                                      UnknownData01[0x14];                                      // 0x05BC(0x0014) MISSED OFFSET
	unsigned char                                      ShowDebugTraces;                                          // 0x05D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xF];                                       // 0x05D1(0x000F) MISSED OFFSET
	unsigned char                                      AutoSpectateAfterDeath;                                   // 0x05E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      DisplayLoadingScreenAtBeginPlay;                          // 0x05E1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxDelayForClientConnectionChecksBeforeLoginOutClient;    // 0x05E4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LastCheckClientConnectionTimestamp;                       // 0x05E8(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FTimerHandle                                PingClientConnectionTimerHandler;                         // 0x05F0(0x0008)
	struct FTimerHandle                                CheckClientConnectionTimerHandler;                        // 0x05F8(0x0008)
	unsigned char                                      WantAutoRun;                                              // 0x0600(0x0001) (ZeroConstructor, IsPlainOldData)
	class UHUDManager*                                 HUDManager;                                               // 0x0608(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UClass*                                      m_DebugWidgetClass;                                       // 0x0610(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DefaultTimeToWaitForLobbyLoading;                         // 0x0618(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDebugInfoWidget*                            m_DebugWidget;                                            // 0x0620(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData03[0x10];                                      // 0x0628(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnKillCountChangedDelegate;                               // 0x0638(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0xF];                                       // 0x0628(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnReceiveHasKilledSomeoneDelegate;                        // 0x0648(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData05[0xF];                                       // 0x0648(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BasePlayerController");
		return ptr;
	}


	void SetInputModeForPlaying();
	void SetInputModeForMenuOpen();
	void Server_RemovePlayerFromSelectedZone();
	void Server_ReceiveLobbyLoaded();
	void Server_PingClientConnection();
	void Server_MakePlayerReturnToMainMenu();
	void Server_AddPlayerToZone(int* zoneIndex);
	void ReceivePlayerMenuClosed();
	void ReceiveLobbyLoaded();
	void ReceiveGamePhaseChanged(EGamePhase* previousGamePhase, EGamePhase* newGamePhase);
	void OnRep_LocalPlayerGamePhase();
	void OnKillCountChanged_DelegateSignature__DelegateSignature(int* KillCount);
	void K2_HandlePlayerDeath();
	void HandlePlayerDeath(struct FDamageCauseInfo* lastDamageCause);
	void HandlePawnSetOnClient();
	void ClientTeleportInitiateWithFailOnServerSide(struct FString* playerName, struct FString* playerStartName, struct FVector* playerStartLocation);
	void ClientTeleportInitiateFuccessfullyOnServerSide(struct FString* playerName);
	void ClientReturnToMainMenuWithMatchData(struct FPlayerMatchData* InMatchData);
	void ClientDisplayErrorLog(struct FString* errorText);
	void Client_DisplayHasKilledSomeoneMessage(class ABasePlayerState** killedPlayerState);
	void CheckClientConnectionValidity();
};


// Class Anarea.BasePlayerInventoryPanel
// 0x0000 (0x02B0 - 0x02B0)
class UBasePlayerInventoryPanel : public UBaseInventoryPanel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Anarea.BasePlayerInventoryPanel");
		return ptr;
	}

};


// Class Anarea.BasePlayerState
// 0x00D0 (0x0410 - 0x0340)
class ABasePlayerState : public APlayerState
{
public:
	struct FString                                     PlayFabId;                                                // 0x0340(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor)
